import numpy as np
import pandas as pd


class Data:
    def __init__(self, financial_statement):
        self.financial_statement = financial_statement

    def get(self, name):
        df = self.financial_statement.pivot(index='date', columns='stock_id')[name].sort_index()
        return df

def create_features(financial_statement):
    data = Data(financial_statement)
    稅前淨利 = data.get('稅前淨利')
    經常稅後淨利 = data.get('合併總損益')
    權益總計 = data.get('股東權益總額')
    營業毛利 = data.get('營業毛利')
    營業收入淨額 = data.get("營業收入淨額")
    營業外收入及支出 = data.get("營業外收入及支出")
    所得稅費用 = data.get("所得稅費用")
    營業費用 = data.get("營業費用")
    推銷費用 = data.get("推銷費用")
    管理費用 = data.get("管理費用")
    研究發展費 = data.get("研究發展費")
    折舊 = data.get('折舊費用')
    攤提 = data.get('攤銷費用')
    繼續營業部門純益 = 稅前淨利-所得稅費用
    存貨 = data.get("存貨")
    股本 = data.get('股本')
    不動產廠房設備合計 = data.get("不動產廠房及設備")
    非流動資產 = data.get("非流動資產")
    預付費用及預付款 = data.get('預付投資款')
    非流動負債 = data.get("非流動負債")
    其他流動資產 = data.get('其他流動資產')
    流動負債 = data.get("流動負債")
    流動資產 = data.get("流動資產")
    財物成本 = data.get('財務成本')

    資產總額 = data.get("資產總額")
    資產總額[資產總額 == 0] = np.nan

    本期綜合損益總額 = data.get("本期綜合損益總額")
    營業利益 = data.get('營業利益')

    稅前息前折舊前淨利 = 稅前淨利.fillna(0) + 財物成本.fillna(0) + 折舊.fillna(0) + 攤提.fillna(0)
    稅前息前折舊前淨利[稅前息前折舊前淨利 == 0] = np.nan

    稅前息前淨利 = 稅前淨利.fillna(0) + 財物成本.fillna(0)
    稅前息前淨利[稅前息前淨利 == 0] = np.nan
    營運現金流 = data.get("營運產生之現金流入_流出")
    歸屬母公司淨利 = data.get('歸屬母公司淨利_損')
    負債總額 = data.get("負債總額")
    營業成本 = data.get("營業成本")
    取得不動產廠房及設備 = data.get("取得不動產_廠房及設備")

    應收帳款與票據 = data.get('應收帳款及票據')
    應收帳款與票據[應收帳款與票據 == 0] = np.nan

    應收帳款週轉率 = 營業收入淨額 / ((應收帳款與票據 + 應收帳款與票據.shift(1)) / 2)

    # 2018年(含)以後所得稅率為20%
    # 2010年(含)至2017年(含)期間所得稅率為17%
    # 2009年(含)以前所得稅率為25%

    import pandas as pd
    所得稅率 = pd.DataFrame(0.2, index=財物成本.index, columns=財物成本.columns)
    所得稅率.loc[:'2017'] = 17
    所得稅率.loc[:'2009'] = 25

    # 獲利能力指標

    ROA稅後息前 = (繼續營業部門純益 + 財物成本 * (1 - 所得稅率)) / 資產總額.rolling(2, min_periods=1).mean() * 100
    ROA綜合損益 = 本期綜合損益總額 / 資產總額.rolling(2, min_periods=1).mean() * 100
    ROE稅後 = 繼續營業部門純益 / 權益總計.rolling(2, min_periods=1).mean() * 100
    ROE綜合損益 = 本期綜合損益總額 / 權益總計.rolling(2, min_periods=1).mean() * 100

    稅前息前折舊前淨利率 = 稅前息前折舊前淨利 / 營業收入淨額 * 100
    營業毛利率 = 營業毛利 / 營業收入淨額 * 100
    營業利益率 = 營業利益 / 營業收入淨額 * 100
    稅前淨利率 = 稅前淨利 / 營業收入淨額 * 100
    稅後淨利率 = 經常稅後淨利 / 營業收入淨額 * 100
    業外收支營收率 = 營業外收入及支出 / 營業收入淨額 * 100
    貝里比率 = 營業毛利 / 營業費用 * 100

    # 成本費用率指標
    營業費用率 = 推銷費用 / 營業費用 * 100
    推銷費用率 = 推銷費用 / 營業收入淨額 * 100
    管理費用率 = 管理費用 / 營業收入淨額 * 100
    研究發展費用率 = 研究發展費 / 營業收入淨額 * 100
    現金流量比率 = 營運現金流 / 流動負債 * 100
    稅率 = (所得稅費用 / 稅前淨利 * 100)
    稅率[(稅前淨利 <= 0) | (所得稅費用 <= 0)] = 0

    # 每股獲利能力指標
    每股營業額 = 營業收入淨額 / 股本 * 10
    每股營業利益 = 營業利益 / 股本 * 10
    每股現金流量 = 營運現金流 / 股本 * 10
    每股綜合損益 = 本期綜合損益總額 / 股本 * 10
    每股稅前淨利 = 稅前淨利 / 股本 * 10
    每股稅後淨利 = 經常稅後淨利 / 股本 * 10
    總負債除總淨值 = 負債總額 / 權益總計 * 100
    負債比率 = 負債總額 / 資產總額 * 100
    淨值除資產 = 權益總計 / 資產總額 * 100

    # 成長率指標
    def 成長率(s):
        return ((s-s.shift(4)) / s.shift(4).abs()) * 100

    營收成長率 = 成長率(營業收入淨額)
    營業毛利成長率 = 成長率(營業毛利)
    營業利益成長率 = 成長率(營業利益)
    稅前淨利成長率 = 成長率(稅前淨利)
    稅後淨利成長率 = 成長率(經常稅後淨利)
    經常利益成長率 = 成長率(繼續營業部門純益)
    資產總額成長率 = 成長率(資產總額)
    淨值成長率 = 成長率(權益總計)

    # 償債能力指標
    流動比率 = 流動資產 / 流動負債 * 100
    速動資產 = 流動資產.fillna(0) - 存貨.fillna(0) - 預付費用及預付款.fillna(0) - 其他流動資產.fillna(0)
    速動資產[速動資產 == 0] = np.nan
    速動比率 = 速動資產 / 流動負債 * 100

    繼續營業部門稅前純益加財務成本 = 繼續營業部門純益.fillna(0) + 財物成本.fillna(0) * (1 - 所得稅率.fillna(0))
    繼續營業部門稅前純益加財務成本[繼續營業部門稅前純益加財務成本 == 0] = np.nan
    利息支出率 = 財物成本 / 繼續營業部門稅前純益加財務成本 * 100

    營運資金 = 流動資產.fillna(0) - 流動負債.fillna(0)
    營運資金[營運資金 == 0] = np.nan

    總資產週轉次數 = 營業收入淨額 / 資產總額.rolling(2, min_periods=1).mean()

    存貨週轉率 = 營業成本 / 存貨.rolling(2, min_periods=1).mean()

    固定資產週轉次數 = 營業收入淨額 / 不動產廠房設備合計.rolling(2, min_periods=1).mean()

    淨值週轉率次數 = 營業收入淨額 / 權益總計.rolling(2, min_periods=1).mean()

    自由現金流量 = 經常稅後淨利.fillna(0) \
               + 折舊.fillna(0) - 攤提.fillna(0) - 取得不動產廠房及設備.fillna(0)\
               - ((流動資產.fillna(0) - 流動負債.fillna(0)) - (流動資產.fillna(0).shift() - 流動負債.fillna(0).shift()))


    自由現金流量[自由現金流量 == 0] = np.nan

    fundamental_data = {

        # checked
        '營業利益': 營業利益,
        'EBITDA': 稅前息前折舊前淨利,
        '營運現金流': 營運現金流,
        '歸屬母公司淨利': 歸屬母公司淨利,
        '折舊': 折舊,
        '流動資產': 流動資產,
        '流動負債': 流動負債,
        '取得不動產廠房及設備': 取得不動產廠房及設備,
        'T7210營運現金流': 營運現金流,

        # 獲利能力指標
        '經常稅後淨利': 經常稅後淨利,
        '營運現金流': 營運現金流,
        'ROA稅後息前': ROA稅後息前,
        'ROA綜合損益': ROA綜合損益,
        'ROE稅後': ROE稅後,
        'ROE綜合損益': ROE綜合損益,
        '稅前息前折舊前淨利率': 稅前息前折舊前淨利率,
        '營業毛利率': 營業毛利率,
        '營業利益率': 營業利益率,
        '稅前淨利率': 稅前淨利率,
        '稅後淨利率': 稅後淨利率,
        '業外收支營收率': 業外收支營收率,
        '貝里比率': 貝里比率,

        # 成本費用率指標
        '營業費用率': 營業費用率,
        '推銷費用率': 推銷費用率,
        '管理費用率': 管理費用率,
        '研究發展費用率': 研究發展費用率,
        '現金流量比率': 現金流量比率,
        '稅率': 稅率,

        # 每股獲利能力指標
        '每股營業額': 每股營業額,
        '每股營業利益': 每股營業利益,  # checked
        '每股現金流量': 每股現金流量,  # checked
        '每股稅前淨利': 每股稅前淨利,  # checked
        '每股綜合損益': 每股綜合損益,  # checked
        #         '每股稅前淨利': 每股稅前淨利, # checked
        '每股稅後淨利': 每股稅後淨利,  #
        '總負債除總淨值': 總負債除總淨值,
        '負債比率': 負債比率,  # checked
        '淨值除資產': 淨值除資產,  #

        # 成長率指標
        '營收成長率': 營收成長率,
        '營業毛利成長率': 營業毛利成長率,
        '營業利益成長率': 營業利益成長率,
        '稅前淨利成長率': 稅前淨利成長率,
        '稅後淨利成長率': 稅後淨利成長率,
        '經常利益成長率': 經常利益成長率,
        '資產總額成長率': 資產總額成長率,
        '淨值成長率': 淨值成長率,

        # 償債能力指標
        '流動比率': 流動比率,
        '速動比率': 速動比率,
        '利息支出率': 利息支出率,
        '營運資金': 營運資金,
        '總資產週轉次數': 總資產週轉次數,
        '存貨週轉率': 存貨週轉率,
        '應收帳款週轉率': 應收帳款週轉率,
        '固定資產週轉次數': 固定資產週轉次數,
        '淨值週轉率次數': 淨值週轉率次數,
        '自由現金流量': 自由現金流量,
        #         '應收帳款週轉率':應收帳款週轉率,
    }
    ret = pd.DataFrame({name: df.unstack() for name, df in fundamental_data.items()})
    ret.index = ret.index.set_names(['stock_id', 'date'])
    return ret
